In [98]:
import pandas as pd

In [99]:
# series for 1 dimensional data
s=pd.Series([354,567,56,342,4,68423])
s

0      354
1      567
2       56
3      342
4        4
5    68423
dtype: int64

In [100]:
print(s.index)
print(s.values)
print(s.dtype)

RangeIndex(start=0, stop=6, step=1)
[  354   567    56   342     4 68423]
int64

In [101]:
s1=pd.Series([3,4,32,42,344,242,5],index=['a','b','c','d','e','f','g'])
# custom indexes are called labels
s1

a      3
b      4
c     32
d     42
e    344
f    242
g      5
dtype: int64

In [102]:
# slicing
print(s[2],"\n")
print(s[3:5],"\n")
print(s1['e'])
print(s1['d':'f'])   # last element is included when we access element using label

56

3    342
4      4
dtype: int64

344
d     42
e    344
f    242
dtype: int64

In [103]:
s1>50

a    False
b    False
c    False
d    False
e     True
f     True
g    False
dtype: bool

In [104]:
print(s1.shape)
print(s1.size)

(7,)
7

In [105]:
type(s1)

pandas.core.series.Series

## **Creating Dataframe**

In [106]:
import pandas as pd

result = {'roll': [11,22,33,44,55,66,77],
'name':["Ali","Sameer","Subhan","Faisal","Asad","Umair","Zohaib"],
'python': [55,76,46,99,88,12,67],
'numpy': [25,65,47,79,80,32,17],
}
dataframe = pd.DataFrame(result)
print(dataframe)

   roll    name  python  numpy
0    11     Ali      55     25
1    22  Sameer      76     65
2    33  Subhan      46     47
3    44  Faisal      99     79
4    55    Asad      88     80
5    66   Umair      12     32
6    77  Zohaib      67     17

### **Reading csv and excel files**

In [107]:
df1 = pd.read_csv('files/Salary_dataset.csv')
print(df1)

    Unnamed: 0  YearsExperience    Salary
0            0              1.2   39344.0
1            1              1.4   46206.0
2            2              1.6   37732.0
3            3              2.1   43526.0
4            4              2.3   39892.0
5            5              3.0   56643.0
6            6              3.1   60151.0
7            7              3.3   54446.0
8            8              3.3   64446.0
9            9              3.8   57190.0
10          10              4.0   63219.0
11          11              4.1   55795.0
12          12              4.1   56958.0
13          13              4.2   57082.0
14          14              4.6   61112.0
15          15              5.0   67939.0
16          16              5.2   66030.0
17          17              5.4   83089.0
18          18              6.0   81364.0
19          19              6.1   93941.0
20          20              6.9   91739.0
21          21              7.2   98274.0
22          22              8.0  101303.0
23          23              8.3  113813.0
24          24              8.8  109432.0
25          25              9.1  105583.0
26          26              9.6  116970.0
27          27              9.7  112636.0
28          28             10.4  122392.0
29          29             10.6  121873.0

In [108]:
df2=pd.read_excel('files/employee.xlsx')
print(df2)
type(df2)

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

pandas.core.frame.DataFrame

In [109]:
# reading specific column
designation = df2["Designation"]
print(designation)
print(type(designation))

0        Manager
1        Officer
2        Officer
3        Manager
4     Office Boy
5     Accountant
6     Accountant
7        Officer
8        Manager
9       Engineer
10       Officer
11    Accountant
12      Engineer
13       Officer
14       Officer
15       Officer
16      Engineer
17    Office Boy
Name: Designation, dtype: object
<class 'pandas.core.series.Series'>

In [110]:
# accessing specific columns
df2[["Emp_ID","Department"]]

    Emp_ID  Department
0     1101    Accounts
1     1107          IT
2     1203          HR
3     1005          HR
4     2123    Accounts
5     2451         NaN
6     1111    Accounts
7     1001          IT
8     1234          IT
9     2156  Production
10    6543  Production
11    3214     Account
12    2156  Production
13    1098          IT
14    2912          IT
15    1222         NaN
16    2156  Production
17    2123    Accounts

In [111]:
# adding new column in df2
df2['bonus'] = [23000,120000,4366,23,43343,4343434,57567,7979,35454,545454,55454,787,3232,3232,434,32,12,2]
print(df2)

    Serial  Emp_ID Designation  Department   Age    Salary    bonus
0        1    1101     Manager    Accounts  50.0  200000.0    23000
1        2    1107     Officer          IT  30.0   80000.0   120000
2        3    1203     Officer          HR  28.0       NaN     4366
3        4    1005     Manager          HR  45.0  120000.0       23
4        5    2123  Office Boy    Accounts  27.0   45000.0    43343
5        6    2451  Accountant         NaN  34.0  100000.0  4343434
6        7    1111  Accountant    Accounts   NaN  110000.0    57567
7        8    1001     Officer          IT  25.0   75000.0     7979
8        9    1234     Manager          IT  23.0       NaN    35454
9       10    2156    Engineer  Production  45.0   89000.0   545454
10      11    6543     Officer  Production  29.0  100000.0    55454
11      12    3214  Accountant     Account  49.0  123000.0      787
12      13    2156    Engineer  Production  45.0   89000.0     3232
13      14    1098     Officer          IT  25.0  100000.0     3232
14      15    2912     Officer          IT  31.0   90000.0      434
15      16    1222     Officer         NaN  25.0       NaN       32
16      17    2156    Engineer  Production  45.0   89000.0       12
17      18    2123  Office Boy    Accounts  27.0   45000.0        2

In [112]:
# adding bonus based on condition
df2["Bonus1"] = [50000 if ((des=="Manager") or (des=="Engineer")) else 40000 if (des=="Officer") else 30000 if (des=="Accountant") else 20000 for des in df2["Designation"]]
print(df2)

    Serial  Emp_ID Designation  Department   Age    Salary    bonus  Bonus1
0        1    1101     Manager    Accounts  50.0  200000.0    23000   50000
1        2    1107     Officer          IT  30.0   80000.0   120000   40000
2        3    1203     Officer          HR  28.0       NaN     4366   40000
3        4    1005     Manager          HR  45.0  120000.0       23   50000
4        5    2123  Office Boy    Accounts  27.0   45000.0    43343   20000
5        6    2451  Accountant         NaN  34.0  100000.0  4343434   30000
6        7    1111  Accountant    Accounts   NaN  110000.0    57567   30000
7        8    1001     Officer          IT  25.0   75000.0     7979   40000
8        9    1234     Manager          IT  23.0       NaN    35454   50000
9       10    2156    Engineer  Production  45.0   89000.0   545454   50000
10      11    6543     Officer  Production  29.0  100000.0    55454   40000
11      12    3214  Accountant     Account  49.0  123000.0      787   30000
12      13    2156    Engineer  Production  45.0   89000.0     3232   50000
13      14    1098     Officer          IT  25.0  100000.0     3232   40000
14      15    2912     Officer          IT  31.0   90000.0      434   40000
15      16    1222     Officer         NaN  25.0       NaN       32   40000
16      17    2156    Engineer  Production  45.0   89000.0       12   50000
17      18    2123  Office Boy    Accounts  27.0   45000.0        2   20000

In [113]:
employee_data = pd.read_excel("files/employee.xlsx")
print(employee_data)

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

In [114]:

employee_data['Bonus_Age'] = [50000 if age>=60
                else 40000 if age>=50
                else 30000 if age>=40
                else 20000 if age>=30
                else 10000 if age>20
                else 5000 for age in employee_data["Age"]]
employee_data

    Serial  Emp_ID Designation  Department   Age    Salary  Bonus_Age
0        1    1101     Manager    Accounts  50.0  200000.0      40000
1        2    1107     Officer          IT  30.0   80000.0      20000
2        3    1203     Officer          HR  28.0       NaN      10000
3        4    1005     Manager          HR  45.0  120000.0      30000
4        5    2123  Office Boy    Accounts  27.0   45000.0      10000
5        6    2451  Accountant         NaN  34.0  100000.0      20000
6        7    1111  Accountant    Accounts   NaN  110000.0       5000
7        8    1001     Officer          IT  25.0   75000.0      10000
8        9    1234     Manager          IT  23.0       NaN      10000
9       10    2156    Engineer  Production  45.0   89000.0      30000
10      11    6543     Officer  Production  29.0  100000.0      10000
11      12    3214  Accountant     Account  49.0  123000.0      30000
12      13    2156    Engineer  Production  45.0   89000.0      30000
13      14    1098     Officer          IT  25.0  100000.0      10000
14      15    2912     Officer          IT  31.0   90000.0      20000
15      16    1222     Officer         NaN  25.0       NaN      10000
16      17    2156    Engineer  Production  45.0   89000.0      30000
17      18    2123  Office Boy    Accounts  27.0   45000.0      10000

In [115]:
employee_data["Bonus1"] = [sal*.5 if sal>=200000
                           else sal*.25 if sal>=150000
                           else sal*.15 if sal>=75000
                           else sal*.1 for sal in employee_data.Salary]
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0

In [116]:
# using function to increment salary
def bonus(sal):
    if sal>20000:
        return sal*.5
    elif sal>150000:
        return sal*.3
    elif sal>=75000:
        return sal*.15
    else:
        return sal*.1

employee_data['Bonus_func'] = employee_data.Salary.apply(bonus)
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0,50000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0,55000.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0,37500.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0,50000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0,61500.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0

In [117]:
employee_data['Bonus2'] = employee_data.Salary.apply(lambda sal:sal*.5 if sal>=200000
                                                     else sal*.3 if sal>=150000
                                                     else sal*.1)
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus2
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0,8000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0,12000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0,50000.0,10000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0,55000.0,11000.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0,37500.0,7500.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN,NaN,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0,50000.0,10000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0,61500.0,12300.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0,10000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0,9000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0

In [118]:
# bonus based on age using lambda function
employee_data["Bonus3"] = employee_data.apply(lambda row:
                                               row["Salary"]*.5 if row["Age"]>=50
                                               else row["Salary"]*.4 if row["Age"]>=40
                                                else row["Salary"]*.1, axis=1) # axis1=row, axis=column
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus2,Bonus3
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0,8000.0,8000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0,12000.0,48000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0,4500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0,50000.0,10000.0,10000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0,55000.0,11000.0,11000.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0,37500.0,7500.0,7500.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN,NaN,NaN,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0,50000.0,10000.0,10000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0,61500.0,12300.0,49200.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0,10000.0,10000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0,9000.0,9000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0,4500.0

In [119]:
# axis is reverse for some methods like axis0=row and axis1=column
# drop method hides column temporarily
employee_data.drop('Bonus2', axis=1)
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus2,Bonus3
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0,8000.0,8000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0,12000.0,48000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0,4500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0,50000.0,10000.0,10000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0,55000.0,11000.0,11000.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0,37500.0,7500.0,7500.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN,NaN,NaN,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0,50000.0,10000.0,10000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0,61500.0,12300.0,49200.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0,10000.0,10000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0,9000.0,9000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,8900.0,35600.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0,4500.0

In [120]:
del employee_data["Bonus2"]
employee_data

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus3
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0,8000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0,48000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0
5,6,2451,Accountant,NaN,34.0,100000.0,20000,15000.0,50000.0,10000.0
6,7,1111,Accountant,Accounts,NaN,110000.0,5000,16500.0,55000.0,11000.0
7,8,1001,Officer,IT,25.0,75000.0,10000,11250.0,37500.0,7500.0
8,9,1234,Manager,IT,23.0,NaN,10000,NaN,NaN,NaN
9,10,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,35600.0
10,11,6543,Officer,Production,29.0,100000.0,10000,15000.0,50000.0,10000.0
11,12,3214,Accountant,Account,49.0,123000.0,30000,18450.0,61500.0,49200.0
12,13,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,35600.0
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0,10000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0,9000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,35600.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0

In [121]:
# top 5 rows
employee_data.head()

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus3
0,1,1101,Manager,Accounts,50.0,200000.0,40000,100000.0,100000.0,100000.0
1,2,1107,Officer,IT,30.0,80000.0,20000,12000.0,40000.0,8000.0
2,3,1203,Officer,HR,28.0,NaN,10000,NaN,NaN,NaN
3,4,1005,Manager,HR,45.0,120000.0,30000,18000.0,60000.0,48000.0
4,5,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0

In [122]:
# last 5 rows
employee_data.tail()

,Serial,Emp_ID,Designation,Department,Age,Salary,Bonus_Age,Bonus1,Bonus_func,Bonus3
13,14,1098,Officer,IT,25.0,100000.0,10000,15000.0,50000.0,10000.0
14,15,2912,Officer,IT,31.0,90000.0,20000,13500.0,45000.0,9000.0
15,16,1222,Officer,NaN,25.0,NaN,10000,NaN,NaN,NaN
16,17,2156,Engineer,Production,45.0,89000.0,30000,13350.0,44500.0,35600.0
17,18,2123,Office Boy,Accounts,27.0,45000.0,10000,4500.0,22500.0,4500.0

## slicing

In [ ]:
# iloc is used to slice data bases of indexes
employee_data.iloc[5:13, 0:6]
# 1st index -> row
# 2nd index -> column
# ending row is excluded

    Serial  Emp_ID Designation  Department   Age    Salary
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0

In [ ]:
# loc is used to slice data bases of labels
employee_data.loc[5:13, "Serial":"Salary"]
# ending row is inclusive in loc method

    Serial  Emp_ID Designation  Department   Age    Salary
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0